<template>
  <div ref="container" class="container">
    Художник-акварелист.
    Основная техника - акварель, жанр - пейзаж, сюжет - сельские и городские мотивы с архитектурой.
    Мне нравится рисовать на пленэре, делать наброски и быстрые этюды. <br/> <br/>

    Я работала в палехских мастерских «Духанин» и «Возрождение», в багетной мастерской, на росписях(сусальное золото), преподавала в художественной мастерской и также занималась росписью по дереву. <br/>

    Участвую в рисовальных марафонах, конкурсах. Посещала Вечерние Рисовальные Классы при Академии художеств, мастер-классы акварелистов. <br/> <br/>

    В данный момент проживаю в Санкт-Петербурге, занимаюсь акварельной живописью, графикой, веду блог, пишу на заказ, провожу мастер-классы и преподаю в школе «Художник онлайн».
  </div>
</template>

<script setup>
import { gsap } from "gsap";
import { SplitText } from "gsap/SplitText";
import { onMounted, ref } from "vue";

const container = ref(null);

onMounted(() => {
  gsap.registerPlugin(SplitText);
  const split = new SplitText(container.value, { type: "lines" });

  gsap.from(split.lines, {
    y: 100,
    autoAlpha: 0,
    stagger: 0.05,
  })
});
</script>